## 028051698106: ConfigRules
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 6 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_config_config_rule.cbs_cloudtrail_enabled will be created
  + resource "aws_config_config_rule" "cbs_cloudtrail_enabled" {
      + arn              = (known after apply)
      + description      = "A Config rule that checks that CloudTrail is enabled and logging to a given bucket."
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + s3BucketName = "cbs-satellite-028051698106"
            }
        )
      + name             = "cbs_cloudtrail_enabled"
      + rule_id          = (known after apply)
      + tags_all         = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::CloudTrail::Trail",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "CLOUD_TRAIL_ENABLED"
        }
    }

  # aws_config_config_rule.cbs_elb_logging_enabled will be created
  + resource "aws_config_config_rule" "cbs_elb_logging_enabled" {
      + arn         = (known after apply)
      + description = "A Config rule that checks whether ELB logging is enabled."
      + id          = (known after apply)
      + name        = "cbs_elb_logging_enabled"
      + rule_id     = (known after apply)
      + tags_all    = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::ElasticLoadBalancing::LoadBalancer",
              + "AWS::ElasticLoadBalancingV2::LoadBalancer",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "ELB_LOGGING_ENABLED"
        }
    }

  # aws_config_config_rule.cbs_s3_bucket_logging_enabled will be created
  + resource "aws_config_config_rule" "cbs_s3_bucket_logging_enabled" {
      + arn              = (known after apply)
      + description      = "A Config rule that checks whether logging to the cbs satellite is enabled for your S3 buckets."
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + targetBucket = "cbs-satellite-028051698106"
            }
        )
      + name             = "cbs_s3_bucket_logging_enabled"
      + rule_id          = (known after apply)
      + tags_all         = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::S3::Bucket",
            ]
        }

      + source {
          + owner             = "CUSTOM_LAMBDA"
          + source_identifier = "arn:aws:lambda:ca-central-1:028051698106:function:CbsS3AccessLogsRule"

          + source_detail {
              + event_source                = "aws.config"
              + maximum_execution_frequency = "TwentyFour_Hours"
              + message_type                = "ScheduledNotification"
            }
        }
    }

  # aws_config_config_rule.cbs_s3_satellite_bucket_rule will be created
  + resource "aws_config_config_rule" "cbs_s3_satellite_bucket_rule" {
      + arn              = (known after apply)
      + description      = "Checks that the CBS satellite bucket exists in the account."
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + satelliteBucket = "cbs-satellite-028051698106"
            }
        )
      + name             = "cbs_s3_satellite_bucket_rule"
      + rule_id          = (known after apply)
      + tags_all         = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::S3::Bucket",
            ]
        }

      + source {
          + owner             = "CUSTOM_LAMBDA"
          + source_identifier = "arn:aws:lambda:ca-central-1:028051698106:function:CbsS3SatelliteBucketRule"

          + source_detail {
              + event_source                = "aws.config"
              + maximum_execution_frequency = "TwentyFour_Hours"
              + message_type                = "ScheduledNotification"
            }
        }
    }

  # aws_config_config_rule.cbs_vpc_flow_logging_enabled will be created
  + resource "aws_config_config_rule" "cbs_vpc_flow_logging_enabled" {
      + arn         = (known after apply)
      + description = "A Config rule that checks whether VPC flow logs are enabled."
      + id          = (known after apply)
      + name        = "cbs_vpc_flow_logging_enabled"
      + rule_id     = (known after apply)
      + tags_all    = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::EC2::VPC",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "VPC_FLOW_LOGS_ENABLED"
        }
    }

  # aws_config_config_rule.cbs_wafv2_logs_rule will be created
  + resource "aws_config_config_rule" "cbs_wafv2_logs_rule" {
      + arn         = (known after apply)
      + description = "Checks that the WAFV2 ACL's are logging to either S3 or Kinesis."
      + id          = (known after apply)
      + name        = "cbs_wafv2_logs_rule"
      + rule_id     = (known after apply)
      + tags_all    = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::WAFv2::WebACL",
            ]
        }

      + source {
          + owner             = "CUSTOM_LAMBDA"
          + source_identifier = "arn:aws:lambda:ca-central-1:028051698106:function:cbs-wafv2-logs-rule"

          + source_detail {
              + event_source                = "aws.config"
              + maximum_execution_frequency = "TwentyFour_Hours"
              + message_type                = "ScheduledNotification"
            }
        }
    }

  # aws_config_conformance_pack.cbs will be destroyed
  # (because aws_config_conformance_pack.cbs is not in configuration)
  - resource "aws_config_conformance_pack" "cbs" {
      - arn           = "arn:aws:config:ca-central-1:028051698106:conformance-pack/cloud-based-sensor/conformance-pack-2u2jfwwsh" -> null
      - id            = "cloud-based-sensor" -> null
      - name          = "cloud-based-sensor" -> null
      - template_body = <<-EOT
            ##################################################################################
            #                                                                                 
            #   Conformance Pack:                                                             
            #     Canadian Centre for Cyber Security (CCCS) Cloud Based Sensor (CBS)                                
            #                                                                                 
            #   This conformance pack helps verify compliance with CBS requirements.   
            #                                                                                 
            #   See Parameters section for names and descriptions of required parameters.     
            #                                                                                 
            ##################################################################################
            
            Resources:
              CloudtrailEnabled:
                Properties:
                  ConfigRuleName: cbs_cloudtrail_enabled
                  Description: A Config rule that checks that CloudTrail is enabled and logging to a given bucket.
                  InputParameters:
                    s3BucketName: cbs-satellite-028051698106
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::CloudTrail::Trail
                  Source:
                    Owner: AWS
                    SourceIdentifier: CLOUD_TRAIL_ENABLED
                Type: AWS::Config::ConfigRule
              ElbLoggingEnabled:
                Properties:
                  ConfigRuleName: cbs_elb_logging_enabled
                  Description: Checks that the CBS satellite bucket exists in the account.
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::ElasticLoadBalancing::LoadBalancer
                      - AWS::ElasticLoadBalancingV2::LoadBalancer
                  Source:
                    Owner: AWS
                    SourceIdentifier: ELB_LOGGING_ENABLED
                Type: AWS::Config::ConfigRule
              S3BucketLoggingEnabled:
                Properties:
                  ConfigRuleName: cbs_s3_bucket_logging_enabled
                  Description: A Config rule that checks whether logging to the cbs satellite is enabled for your S3 buckets.
                  InputParameters:
                    targetBucket: cbs-satellite-028051698106
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::S3::Bucket
                  Source:
                    Owner: CUSTOM_LAMBDA
                    SourceDetails:
                      - EventSource: aws.config
                        MaximumExecutionFrequency: TwentyFour_Hours
                        MessageType: ScheduledNotification
                    SourceIdentifier: arn:aws:lambda:ca-central-1:028051698106:function:CbsS3AccessLogsRule
                Type: AWS::Config::ConfigRule
              S3SatelliteBucket:
                Properties:
                  ConfigRuleName: cbs_s3_satellite_bucket_rule
                  Description: Checks that the CBS satellite bucket exists in the account.
                  InputParameters:
                    satelliteBucket: cbs-satellite-028051698106
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::S3::Bucket
                  Source:
                    Owner: CUSTOM_LAMBDA
                    SourceDetails:
                      - EventSource: aws.config
                        MaximumExecutionFrequency: TwentyFour_Hours
                        MessageType: ScheduledNotification
                    SourceIdentifier: arn:aws:lambda:ca-central-1:028051698106:function:CbsS3SatelliteBucketRule
                Type: AWS::Config::ConfigRule
              VpcFlowLogsEnabled:
                Properties:
                  ConfigRuleName: cbs_vpc_flow_logging_enabled
                  Description: A Config rule that checks whether VPC flow logs are enabled.
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::EC2::VPC
                  Source:
                    Owner: AWS
                    SourceIdentifier: VPC_FLOW_LOGS_ENABLED
                Type: AWS::Config::ConfigRule
              WAFv2LoggingEnabled:
                Properties:
                  ConfigRuleName: cbs_wafv2_logs_rule
                  Description: Checks that the WAFV2 ACL's are logging to either S3 or Kinesis.
                  Scope:
                    ComplianceResourceTypes:
                      - AWS::WAFv2::WebACL
                  Source:
                    Owner: CUSTOM_LAMBDA
                    SourceDetails:
                      - EventSource: aws.config
                        MaximumExecutionFrequency: TwentyFour_Hours
                        MessageType: ScheduledNotification
                    SourceIdentifier: arn:aws:lambda:ca-central-1:028051698106:function:cbs-wafv2-logs-rule
                Type: AWS::Config::ConfigRule
        EOT -> null
    }

  # aws_lambda_function.cbs_s3_access_logs_rule will be updated in-place
  ~ resource "aws_lambda_function" "cbs_s3_access_logs_rule" {
        id                             = "CbsS3AccessLogsRule"
      ~ last_modified                  = "2022-01-28T15:12:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "Y9QD3YDIyTpZOr/qi4pgHc6oa/Gn17oXmTG0rJkavZI=" -> "lU8i6gYu78MxjpuRHpKtVChRfSlJYmAdAnA/Fgg8zN4="
        tags                           = {
            "CostCentre" = "cbs-028051698106"
            "Terraform"  = "true"
        }
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 6 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_cloudtrail_enabled"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_elb_logging_enabled"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_s3_bucket_logging_enabled"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_s3_satellite_bucket_rule"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_vpc_flow_logging_enabled"]
WARN - plan.json - main - Missing Common Tags: ["aws_config_config_rule.cbs_wafv2_logs_rule"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.aws_config_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.security_config"]

16 tests, 8 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
